# ввод данных
while True:
    x = float(input('Введите значение x: '))

    if abs(x) >= 1:
        print('\n\nРезультат:\n')
        print('Неверное значение х\n')
        print('________________________________________\n')
        continue

    e = float(input('Введите погрешность e: '))

    print('\n\nРезультат:\n')

    if e < 0:
        print('Неверное значение e\n')
        print('________________________________________\n')
        continue

    n = 0
    summ = 0

    # расчет значения правой части равенства
    while True:
        fraction = ((-1) ** (n + 1) - 5 / (3 ** (n + 1))) * x ** n
        summ += fraction
        result = summ / 4
        if abs((x + 2) / (x ** 2 - 2 * x - 3) - result) < e:
            break
        n += 1

    # вывод ответа
    print('Левая часть равенства      ', f'{(x + 2) / (x ** 2 - 2 * x - 3):<.6g}')
    print('Правая часть равенства     ', f'{result:<.6g}\n')
    print('________________________________________\n')